{
    "data":
    [
        {
          "id": "Numerical value assigned to course based on its 'subject' and its 'courseNumber'. It is the combination of the course's 'subject ID' and its 'courseNumber'.",
          "termEffective": "Current value of term according to the year and semester. Follows Stetson's original system.",
          "courseNumber": "Numerical value that corresponds to the course's number for registration. Ex.: 141 for CSCI141",
          "courseTitle": "Name of the course.",
          "subject": "Alphanumeric abbreviation of the major or area that the course corresponds with. CSCI for Computer Science, etc.",
          "subjectCode": "Duplication of the value paired with the course's 'subject' key.",
          "subjectId": "Numerical value assigned to the subject that the course belongs to.",
          "college": "The school that oversees the course. This could be 'College of Arts and Sciences', 'School of Business', etc.",
          "collegeCode": "Alphanumeric abbreviation of the value paired with the course's 'college' key.",
          "department": "Faculty department that the course corresponds with. Ex: American Studies, Mathematics, etc.",
          "departmentCode": "Alphanumeric abbreviation of the value paired with the course's 'department' key.",
          "numberOfUnits": "Numerical value that represents the number of units the course is worth.",
          "attributes": "A list of all the General Education attributes that this course possesses.",
          "ceu": "Continuing Education Unit. Used in continuing education programs to assist professionals in maintaining their license in their profession.",

          "scheduleType": "A two-letter abbreviation of the value for the course's 'scheduleTypeDescription' key.",
          "scheduleTypeDescription": "THe full definition of what the value of the 'scheduleType' key represents.",
          "restrictions": "Specifies when this course is offered. Has acceptable values of: ['Fall Only', 'Spring Only', 'Fall and Spring']",
          "restrictionsPeriod": "Specifies how often this course is offered. Has acceptable values of ['Every semester', 'Annually', 'Every two years', 'Every three years', etc.]",

          "creditHourLow": "The minimum number of credits that a student can receive for this course.",
          "creditHourHigh": "The maximum number of credits that a student can receive for this course.",
          "creditHourIndicator": "There are only three acceptable values for this key: [null, 'TO', 'OR']",
          "lectureHourLow": "",
          "lectureHourHigh": "",
          "lectureHourIndicator": "",
          "billHourLow": "",
          "billHourHigh": "",
          "billHourIndicator": "",
          "labHourLow": "",
          "labHourHigh": "",
          "labHourIndicator": "",
          "otherHourLow": "",
          "otherHourHigh": "",
          "otherHourIndicator": "",

          "description": "",
          "subjectDescription": "The full definition of what the value of the 'subject' key represents.",
          "courseDescription": "A description of the topics covered in the course and how it might be structured.",
          "termStart": "The Semester during which this course was first offered.",
          "termEnd": "'999999', equivalent to the 'End of Time'",
          "preRequisiteCheckMethodCde": "B",
          "prerequisites": "A list of the prerequisites that are required for a student to register for this course."
        }
    ]
}
